import React from 'react';
import './Chatbot_hindiS.css';
import './App.css'

const Chatbot_HindiS = () => {
    return (
    <div id = "chatbot-hindi" className='page'>
        <h1>कहानी: बन्दर चाल</h1>
        {/* <div> */}
            <textarea id="text" name="enterText" rows={20} cols={125} >
    एक बार कुछ बंदरों को एक बड़े से पिंजरे में डाला गया और वहां पर एक सीढी लगाई गई| सीढी के ऊपरी भाग पर कुछ केले लटका दिए गए| उन केलों को खाने के लिए एक बन्दर सीढी के पास पहुंचा|
    जैसे ही वह बन्दर सीढी पर चढ़ने लगा, उस पर बहुत सारा ठंडा पानी गिरा दिया गया और उसके साथ-साथ बाकी बंदरों पर भी पानी गिरा दिया गया|
    पानी डालने पर वह बन्दर भाग कर एक कोने में चला गया|
    थोड़ी देर बाद एक दूसरा बन्दर सीढी के पास पहुंचा|
    वह जैसे ही सीढी के ऊपर चढ़ने लगा, फिर से बन्दर पर ठंडा पानी गिरा दिया गया और इसकी सजा बाकि बंदरों को भी मिली और साथ-साथ दूसरे बंदरो पर भी ठंडा पानी गिरा दिया गया|
    ठन्डे पानी के कारण सारे बन्दर भाग कर एक कोने में चले गए| यह प्रक्रिया चलती रही और जैसे ही कोई बन्दर सीढी पर केले खाने के लिए चढ़ता, उस पर और साथ-साथ बाकि बंदरों को इसकी सजा मिलती और उन पर ठंडा पानी डाल दिया जाता|
    बहुत बार ठन्डे पानी की सजा मिलने पर बन्दर समझ गए कि अगर कोई भी उस सीढी पर चढ़ने की कोशिश करेगा तो इसकी सजा सभी को मिलेगी और उन सभी पर ठंडा पानी डाल दिया जाएगा|
    अब जैसे ही कोई बन्दर सीढी के पास जाने की कोशिश करता तो बाकी सारे बन्दर उसकी पिटाई कर देते और उसे सीढी के पास जाने से रोक देते|
    थोड़ी देर बाद उस बड़े से पिंजरे में से एक बन्दर को निकाल दिया गया और उसकी जगह एक नए बन्दर को डाला गया|
    नए बन्दर की नजर केलों पर पड़ी| नया बन्दर वहां की परिस्थिति के बारे में नहीं जानता था इसलिए वह केले खाने के लिए सीढी की तरफ भागा| जैसे ही वह बन्दर उस सीढी की तरफ भागा, बाकि सारे बंदरों ने उसकी पिटाई कर दी| नया बन्दर यह समझ नहीं पा रहा था कि उसकी पिटाई क्यों हुई | लेकिन जोरदार पिटाई से डरकर उसने केले खाने का विचार छोड़ दिया|
    अब फिर एक पुराने बन्दर को उस पिंजरे से निकाला गया और उसकी जगह एक नए बन्दर को पिंजरे में डाला गया| नया बन्दर बेचारा वहां की परिस्थिति को नहीं जनता था इसलिए वह केले खाने के लिए सीढी की तरफ जाने लगा और यह देखकर बाकी सारे बंदरों ने उसकी पिटाई कर दी| पिटाई करने वालों में पिछली बार आया नया बन्दर भी शामिल था जबकि उसे यह भी नहीं पता था कि यह पिटाई क्यों हो रही है|
    यह प्रक्रिया चलती रही और एक-एक करके पुराने बंदरों की जगह नए बंदरों को पिंजरे में डाला जाने लगा| जैसे ही कोई नया बन्दर पिंजरे में आता और केले खाने के लिए सीढी के पास जाने लगता तो बाकी सारे बन्दर उसकी पिटाई कर देते|
    अब पिंजरे में सारे नए बन्दर थे जिनके ऊपर एक बार भी ठंडा पानी नहीं डाला गया था| उनमें से किसी को यह नहीं पता था कि केले खाने के लिए सीढी के पास जाने वाले की पिटाई क्यों होती है लेकिन उन सबकी एक-एक बार पिटाई हो चुकी थी| अब एक और बन्दर को पिंजरे में डाला गया और आश्चर्य कि फिर से वही हुआ| सारे बंदरों ने उस नए बन्दर को सीढी के पास जाने से रोक दिया और उसकी पिटाई कर दी जबकि पिटाई करने वालों में से किसी को भी यह नहीं पता था कि वह पिटाई क्यों कर रहे है|
            </textarea>
        {/* </div> */}
        <div id="identify">
            दिया गया पाठ निम्न में है:
        </div>
            <button id="translate" class="button">अनुवाद करें</button>
            <button id="read" class="button">पढ़े</button>
        
    </div>
  )
}

export default Chatbot_HindiS